public_html/app/Models/Pedidos_model.php

SELECT `pedidos`.*, `clientes`.`nombre_cliente`, `users`.`nombre_usuario`, `users`.`apellidos_usuario`
FROM `pedidos`
LEFT JOIN `clientes` ON `clientes`.`id_cliente` = `pedidos`.`id_cliente`
LEFT JOIN `users` ON `users`.`id` = `pedidos`.`id_usuario`
WHERE `pedidos`.`id_pedido` = '57'
 LIMIT 1
---
    public function findPedidoWithUser($id_pedido)
    {
        return $this->select('pedidos.*, clientes.nombre_cliente, users.nombre_usuario, users.apellidos_usuario')
            ->join('clientes', 'clientes.id_cliente = pedidos.id_cliente', 'left')
            ->join('users', 'users.id = pedidos.id_usuario', 'left')
            ->where('pedidos.id_pedido', $id_pedido)
            ->first();