public_html/app/Controllers/Contactos.php

SELECT *
FROM `clientes`
---
    public function index()
    {
        helper('controlacceso');
        $nivel = control_login();
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $clienteModel = new \App\Models\ClienteModel($db);
        $clientes = $clienteModel->findAll();

SELECT *
FROM `contactos`
---
    public function getContactos()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $model = new ContactoModel($db);
        $contactos = $model->findAll();