public_html/app/Controllers/Familia_proveedor.php

    public function getFamiliasProveedores()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $model = new FamiliaProveedorModel($db);
        $familias = $model->findAll();
---
SELECT *
FROM `familia_proveedor`