public_html/app/Controllers/Fichajes.php

SELECT *
FROM `fichajes`
---
    public function getFichajes()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $fichajesModel = new FichajesModel($db);
        $usuariosModel = new Usuarios2_Model($db);

        $fichajes = $fichajesModel->findAll();