public_html/app/Controllers/Fichar.php

	public function CompruebaDia()
	{
		$aviso = "";
		$hoy = date('Y-m-d');
		$dia = date('j');

		$datos = new Hoy($this->db);
		$diahoy = $datos->where('id', 1)->findAll();
---
SELECT *
FROM `hoy`
WHERE `id` = 1

			'total' => $totalMinutos
		];

		$fichajes->insert($data);
---
INSERT INTO `fichajes` (`id_usuario`, `entrada`, `salida`, `incidencia`, `extras`, `total`) VALUES ('1', '2024-12-23 13:39:04', '2024-12-23 13:39:09', '', '1', 0)