public_html/app/Controllers/Laborables.php

	public function index()
	{
		helper('controlacceso');
        $redirect = check_access_level();
        $redirectUrl = session()->getFlashdata('redirect');
        if ($redirect && is_string($redirectUrl)) {
            return redirect()->to($redirectUrl);
        }
		helper('controlacceso');
		$nivel = control_login();
		$data = usuario_sesion();
		$db = db_connect($data['new_db']);

		$this->addBreadcrumb('Inicio', base_url('/'));
		$this->addBreadcrumb('Laborables');
		$data['amiga'] = $this->getBreadcrumbs();

		$laborablesModel = new Laborables_model($db);
		$laborables = $laborablesModel->find(1);
---
SELECT *
FROM `laborables`
WHERE `laborables`.`id` = 1