public_html/app/Controllers/Partes_controller.php

    public function parte_print($id_lineapedido)
    {
        /** APARTADO STANDARD PARA TODOS LOS CONTROLADORES **/
        // Control de login
        helper('controlacceso');
        control_login();

        // Saco los datos del usuario
        $data = datos_user();

        // Conecto la BDD
        $db = db_connect($data['new_db']);

        // Obtener la línea de pedido
        $builder = $db->table('linea_pedidos');
        $builder->select('*');
        $builder->where('id_lineapedido', $id_lineapedido);
        $query = $builder->get();
---
SELECT *
FROM `linea_pedidos`
WHERE `id_lineapedido` = '143'

            $builder = $db->table('pedidos');
            $builder->select('*');
            $builder->where('id_pedido', $elpedido);
            $query2 = $builder->get();
---
SELECT *
FROM `pedidos`
WHERE `id_pedido` = '57'

                $builder = $db->table('clientes');
                $builder->select('*');
                $builder->where('id_cliente', $elcliente);
                $query5 = $builder->get();
---
SELECT *
FROM `clientes`
WHERE `id_cliente` = '1707'

            $builder->where('id_pedido', $elpedido);
            $builder->where('id_lineapedido !=', $id_lineapedido); // Excluir línea actual
            $builder->join('productos', 'productos.id_producto = linea_pedidos.id_producto', 'left');
            $queryMasDeUnaLinea = $builder->get();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '7'