public_html/app/Controllers/Pedidos_proveedor.php

    public function todos()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $builder = $db->table('pedidos_proveedor');

        $builder->select('id_pedido, fecha_salida, id_proveedor, referencia, estado, fecha_entrega, id_usuario, total_pedido');
        $builder->orderBy('fecha_salida', 'desc');
        $builder->orderBy('id_pedido', 'desc');

        $pedidos = $builder->get()->getResultArray();
---
SELECT `id_pedido`, `fecha_salida`, `id_proveedor`, `referencia`, `estado`, `fecha_entrega`, `id_usuario`, `total_pedido`
FROM `pedidos_proveedor`
ORDER BY `fecha_salida` DESC, `id_pedido` DESC

    private function getProveedorNombre($id_proveedor)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $proveedor = $db->table('proveedores')->select('nombre_proveedor')->where('id_proveedor', $id_proveedor)->get()->getRow();
---
SELECT `nombre_proveedor`
FROM `proveedores`
WHERE `id_proveedor` = '10'

    private function getUsuarioNombre($id_usuario)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $usuario = $db->table('users')->select('nombre_usuario')->where('id', $id_usuario)->get()->getRow();
---
SELECT `nombre_usuario`
FROM `users`
WHERE `id` = '3'