public_html/app/Controllers/Pedidos.php

SELECT `linea_pedidos`.*, `productos`.`nombre_producto`
FROM `linea_pedidos`
JOIN `productos` ON `productos`.`id_producto` = `linea_pedidos`.`id_producto`
WHERE `linea_pedidos`.`id_pedido` = '57'
SELECT *
FROM `productos`
SELECT *
FROM `users`
SELECT *
FROM `clientes`
SELECT *
FROM `estados`
---
	public function edit($id_pedido)
	{
		helper('controlacceso');
		$session = session();
		$data = datos_user();
		$db = db_connect($data['new_db']);
		$pedidoModel = new Pedidos_model($db);
		$clienteModel = new ClienteModel($db);
		$estadoModel = new EstadoModel($db);
		$productosModel = new Productos_model($db);
		$usuarioModel = new Usuarios2_Model($db);
		// Obtener el pedido actual a editar
		$pedido = $pedidoModel->findPedidoWithUser($id_pedido);
		if (!$pedido) {
			return redirect()->back()->with('error', 'Pedido no encontrado');
		}
		// Obtener las líneas de pedido con el nombre del producto
		$builder = $db->table('linea_pedidos');
		$builder->select('linea_pedidos.*, productos.nombre_producto');
		$builder->join('productos', 'productos.id_producto = linea_pedidos.id_producto');
		$builder->where('linea_pedidos.id_pedido', $id_pedido);
		$query = $builder->get();
		$lineas_pedido = $query->getResultArray();

		// Pasar los datos a la vista
		$data['productos'] = $productosModel->findAll();
		$data['users'] = $usuarioModel->findAll();
		$data['clientes'] = $clienteModel->findAll();
		$data['estados'] = array_filter($estadoModel->findAll(), function ($estado) {
			return $estado['id_estado'] != 3; // Filtra el estado con id 3
		});

SELECT SUM(`total_linea`) AS `suma_total`
FROM `linea_pedidos`
WHERE `id_pedido` = '57'
---
	public function actualizarTotalPedido($id_pedido)
	{
		$data = usuario_sesion();
		$db = db_connect($data['new_db']);
		$builder = $db->table('linea_pedidos');
		$builder->selectSum('total_linea', 'suma_total');
		$builder->where('id_pedido', $id_pedido);
		$query = $builder->get();

UPDATE `procesos_pedidos` SET `estado` = '3'
WHERE `id_linea_pedido` = '136'
UPDATE `linea_pedidos` SET `id_producto` = '4', `n_piezas` = '0', `precio_venta` = '0', `nom_base` = '', `med_inicial` = '', `med_final` = '', `lado` = '', `distancia` = '', `estado` = '3', `fecha_entrada` = '2024-12-05', `fecha_entrega` = '2024-12-19', `observaciones` = '', `total_linea` = NULL
WHERE `linea_pedidos`.`id_lineapedido` IN ('136')
---
	public function updateLineaPedido($id_lineapedido)
	{
		$data = usuario_sesion();
		$db = db_connect($data['new_db']);
		$lineaspedidoModel = new LineaPedido($db);
		$procesosPedidoModel = new ProcesosPedido($db);
		// Datos a actualizar en linea_pedidos
		$updateData = [
			'id_producto' => $this->request->getPost('id_producto') ?? null,
			'n_piezas' => $this->request->getPost('n_piezas') ?? null,
			'precio_venta' => $this->request->getPost('precio_venta') ?? null,
			'nom_base' => $this->request->getPost('nom_base') ?? null,
			'med_inicial' => $this->request->getPost('med_inicial') ?? null,
			'med_final' => $this->request->getPost('med_final') ?? null,
			'lado' => $this->request->getPost('lado') ?? null,
			'distancia' => $this->request->getPost('distancia') ?? null,
			'estado' => $this->request->getPost('estado') ?? null,
			'fecha_entrada' => $this->request->getPost('fecha_entrada') ?? null,
			'fecha_entrega' => $this->request->getPost('fecha_entrega') ?? null,
			'observaciones' => $this->request->getPost('observaciones') ?? null,
			'total_linea' => ($this->request->getPost('n_piezas') && $this->request->getPost('precio_venta')) ? $this->request->getPost('n_piezas') * $this->request->getPost('precio_venta') : null,
		];
		if ($lineaspedidoModel->update($id_lineapedido, $updateData)) {
			$id_pedido = $this->request->getPost('id_pedido');
			// Actualizar el estado en la tabla procesos_pedidos
			if (isset($updateData['estado'])) {
				$procesosPedidoModel->where('id_linea_pedido', $id_lineapedido)
					->set('estado', $updateData['estado'])
					->update();

SELECT *
FROM `linea_pedidos`
WHERE `linea_pedidos`.`id_lineapedido` = '136'
---
	public function deleteLinea($id_lineapedido)
	{
		$data = usuario_sesion();
		$db = db_connect($data['new_db']);
		$lineaPedidoModel = new LineaPedido($db);
		$procesosPedidoModel = new ProcesosPedido($db);
		$linea = $lineaPedidoModel->where('id_lineapedido', $id_lineapedido)->first();

SELECT *
FROM `estados`
---
	public function actualizarEstadoPedido($id_pedido)
	{
		$data = usuario_sesion();
		$db = db_connect($data['new_db']);
		$builder = $db->table('linea_pedidos');
		$builder->select('estado');
		$builder->where('id_pedido', $id_pedido);
		$query = $builder->get();