public_html/app/Controllers/Pedidos.php

UPDATE `pedidos` SET `total_pedido` = '25.5'
WHERE `pedidos`.`id_pedido` IN ('57')
---

		$updateData['estado'] = $pedido->estado;

		if ($pedidoModel->update($id_pedido, $updateData)) {