public_html/app/Controllers/Procesos_pedidos.php

SELECT *
FROM `linea_pedidos`
WHERE `estado` IN (2,3)
SELECT *
FROM `procesos_pedidos`
WHERE `estado` = 2
---
    public function index()
    {
        helper('controlacceso');
        $redirect = check_access_level();
        $redirectUrl = session()->getFlashdata('redirect');
        if ($redirect && is_string($redirectUrl)) {
            return redirect()->to($redirectUrl);
        }
        $redirect = check_access_level();
        $redirectUrl = session()->getFlashdata('redirect');
        if ($redirect && is_string($redirectUrl)) {
            return redirect()->to($redirectUrl);
        }
        $data = datos_user();
        $db = db_connect($data['new_db']);
        $lineaPedidoModel = new LineaPedido($db);
        $pedidoModel = new Pedidos_model($db);
        $productoModel = new Producto($db);
        $clienteModel = new ClienteModel($db);
        $procesoProducto = new ProcesoProducto($db);
        $procesoModel = new Proceso($db);
        $maquinasModel = new Maquinas($db);
        $procesosPedidoModel = new ProcesosPedido($db);
        $lineasConEstado2 = $this->obtenerLineasPedidoConEstado2YCrearProcesos();
        // Obtener líneas de pedido con estado = 2
        $lineas = $lineaPedidoModel->whereIn('estado', [2, 3])->findAll();

        // Obtener procesos_pedido con estado = 2
        $procesosPedido = $procesosPedidoModel->where('estado', 2)->findAll();

SELECT *
FROM `pedidos`
WHERE `pedidos`.`id_pedido` = '57'
SELECT *
FROM `clientes`
WHERE `clientes`.`id_cliente` = '1707'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
SELECT *
FROM `procesos`
WHERE `procesos`.`id_proceso` = '1'
---
        foreach ($lineas as $linea) {
            foreach ($procesosPedido as $procesoPedido) {
                if ($linea['id_lineapedido'] == $procesoPedido['id_linea_pedido']) {
                    $pedido = $pedidoModel->find($linea['id_pedido']);
                    $cliente = $clienteModel->find($pedido->id_cliente);
                    $producto = $productoModel->find($linea['id_producto']);
                    $proceso = $procesoModel->find($procesoPedido['id_proceso']);

SELECT *
FROM `procesos_pedidos`
WHERE `estado` = 3
ORDER BY `id_maquina` ASC, `orden` ASC
SELECT *
FROM `linea_pedidos`
WHERE `linea_pedidos`.`id_lineapedido` = '142'
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id_pedido` = '57'
SELECT *
FROM `clientes`
WHERE `clientes`.`id_cliente` = '1707'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
SELECT *
FROM `procesos`
WHERE `procesos`.`id_proceso` = '1'
---


        // Obtener líneas con estado = 3 y ordenar por el campo 'id_maquina'
        $lineasEstado3 = $procesosPedidoModel->where('estado', 3)->orderBy('id_maquina', 'ASC')->orderBy('orden', 'ASC')->findAll();
        $dataEstado3 = [];

        foreach ($lineasEstado3 as $lineaEstado3) {
            $lineaPedido = $lineaPedidoModel->find($lineaEstado3['id_linea_pedido']);
            $pedido = $pedidoModel->find($lineaPedido['id_pedido']);
            $cliente = $clienteModel->find($pedido->id_cliente);
            $producto = $productoModel->find($lineaPedido['id_producto']);
            $proceso = $procesoModel->find($lineaEstado3['id_proceso']);

SELECT *
FROM `maquinas`
SELECT *
FROM `procesos`
SELECT *
FROM `clientes`
SELECT *
FROM `productos`
---
        }

        // Obtener todas las máquinas
        $maquinas = $maquinasModel->findAll();
        $procesos = $procesoModel->findAll();
        $clientes = $clienteModel->findAll();
        $productos = $productoModel->findAll();

SELECT *
FROM `procesos`
WHERE `nombre_proceso` = 'CORTE DE TIRAS'
 LIMIT 1
SELECT *
FROM `procesos_pedidos`
WHERE `id_linea_pedido` = '142'
SELECT *
FROM `linea_pedidos`
WHERE `id_lineapedido` = '142'
 LIMIT 1
---
    public function actualizarEstadoProcesos()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $procesosPedidoModel = new ProcesosPedido($db);
        $procesoModel = new Proceso($db);
        $lineaPedidoModel = new LineaPedido($db);
        $pedidoModel = new Pedidos_model($db);
        $data = $this->request->getJSON(true);

        if (!isset($data['procesos']) || !is_array($data['procesos'])) {
            return $this->response->setJSON(['error' => 'Datos inválidos']);
        }
        foreach ($data['procesos'] as $proceso) {
            if (isset($proceso['nombre_proceso']) && isset($proceso['id_linea_pedido']) && isset($proceso['id_maquina']) && isset($proceso['orden'])) {
                $procesoEncontrado = $procesoModel
                    ->where('nombre_proceso', $this->db->escapeLikeString($proceso['nombre_proceso'])) // Escapando caracteres especiales
                    ->first();
                if ($procesoEncontrado) {
                    $idProceso = $procesoEncontrado['id_proceso'];
                    // Pasar el orden específico
                    $this->calcularYActualizarOrdenParaMaquina($proceso['id_maquina'], $idProceso, $proceso['id_linea_pedido'], $proceso['orden']);

                    $actualizarLineaPedido = true;
                    $procesosDeLaLinea = $procesosPedidoModel
                        ->where('id_linea_pedido', $proceso['id_linea_pedido'])
                        ->findAll();

UPDATE `linea_pedidos` SET `estado` = 3
WHERE `id_lineapedido` = '142'
UPDATE `pedidos` SET `estado` = 3
WHERE `id_pedido` = '57'
---
                        }
                    }
                    if ($actualizarLineaPedido) {
                        $lineaPedidoModel
                            ->where('id_lineapedido', $proceso['id_linea_pedido'])
                            ->set(['estado' => 3])
                            ->update();

UPDATE `procesos_pedidos` SET `estado` = 3, `id_maquina` = '15', `orden` = 1
WHERE `id_proceso` = '1'
AND `id_linea_pedido` = '142'
AND `estado` = 2
---
    private function calcularYActualizarOrdenParaMaquina($idMaquina, $idProceso, $idLineaPedido, $orden)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $procesosPedidoModel = new ProcesosPedido($db);

        // Actualizar el proceso con el orden específico y estado 3
        $procesosPedidoModel
            ->where('id_proceso', $idProceso)
            ->where('id_linea_pedido', $idLineaPedido)
            ->where('estado', 2)
            ->set(['estado' => 3, 'id_maquina' => $idMaquina, 'orden' => $orden])
            ->update();

SELECT DISTINCT `id_linea_pedido`
FROM `procesos_pedidos`
SELECT COUNT(*) AS `numrows`
FROM `procesos_pedidos`
WHERE `id_linea_pedido` = '135'
AND `estado` = 3
UPDATE `linea_pedidos` SET `estado` = 3
WHERE `linea_pedidos`.`id_lineapedido` IN ('136')
UPDATE `pedidos` SET `estado` = 3
WHERE `pedidos`.`id_pedido` IN ('57')
SELECT *
FROM `linea_pedidos`
WHERE `linea_pedidos`.`id_lineapedido` = '136'
---
    public function actualizarEstadoLineaPedido()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $lineaPedidoModel = new LineaPedido($db);
        $procesosPedidoModel = new ProcesosPedido($db);
        $pedidoModel = new Pedidos_model($db); // Asumiendo que existe un modelo Pedido para la tabla pedidos

        // Obtener todos los id_linea_pedido únicos de procesos_pedidos
        $procesosPedido = $procesosPedidoModel->select('id_linea_pedido')->distinct()->findAll();

        foreach ($procesosPedido as $procesoPedido) {
            $idLineaPedido = $procesoPedido['id_linea_pedido'];

            // Verificar si existe al menos un proceso en estado 3 para el id_linea_pedido actual
            $existeProcesoEnEstado3 = $procesosPedidoModel
                ->where('id_linea_pedido', $idLineaPedido)
                ->where('estado', 3)
                ->countAllResults() > 0;

            // Si existe al menos un proceso en estado 3, actualizar el estado de la línea de pedido a 3
            if ($existeProcesoEnEstado3) {
                $lineaPedidoModel->update($idLineaPedido, ['estado' => 3]);

                // Obtener el id_pedido asociado a la línea de pedido actualizada
                $idPedido = $lineaPedidoModel->find($idLineaPedido)['id_pedido'];

SELECT *
FROM `linea_pedidos`
WHERE `estado` = 2
SELECT *
FROM `procesos_productos`
WHERE `id_producto` = '18'
SELECT *
FROM `procesos_pedidos`
WHERE `id_proceso` = '1'
AND `id_linea_pedido` = '136'
 LIMIT 1
---
    public function obtenerLineasPedidoConEstado2YCrearProcesos()
    {
        $data = datos_user();
        $db = db_connect($data['new_db']);
        $lineaPedidoModel = new LineaPedido($db);
        $procesosPedidoModel = new ProcesosPedido($db);
        $procesosProductosModel = new ProcesosProductos($db);

        // Obtener líneas de pedido con estado = 2
        $lineasConEstado2 = $lineaPedidoModel->where('estado', 2)->findAll();

        foreach ($lineasConEstado2 as $linea) {
            $idProducto = $linea['id_producto'];

            // Obtener todos los procesos asociados a este producto
            $procesosProductos = $procesosProductosModel->where('id_producto', $idProducto)->findAll();

            foreach ($procesosProductos as $procesoProducto) {
                // Comprobar si ya existe una línea con este id_proceso y id_linea_pedido
                $existe = $procesosPedidoModel->where([
                    'id_proceso' => $procesoProducto['id_proceso'],
                    'id_linea_pedido' => $linea['id_lineapedido']
                ])->first();