public_html/app/Controllers/Proveedores.php

    public function getProveedores()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $builder = $db->table('proveedores');
        $builder->select('proveedores.id_proveedor, proveedores.nombre_proveedor, proveedores.nif, proveedores.direccion, proveedores.contacto, proveedores.telf,proveedores.web, proveedores.email, provincias.provincia AS nombre_provincia');
        $builder->join('provincias', 'proveedores.id_provincia = provincias.id_provincia', 'left');
        $result = $builder->get()->getResult();
---
SELECT `proveedores`.`id_proveedor`, `proveedores`.`nombre_proveedor`, `proveedores`.`nif`, `proveedores`.`direccion`, `proveedores`.`contacto`, `proveedores`.`telf`, `proveedores`.`web`, `proveedores`.`email`, `provincias`.`provincia` AS `nombre_provincia`
FROM `proveedores`
LEFT JOIN `provincias` ON `proveedores`.`id_provincia` = `provincias`.`id_provincia`

    public function edit($id)
    {
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Proveedores', base_url('/proveedores'));
        $this->addBreadcrumb('Editar Proveedor');
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $proveedoresModel = new ProveedoresModel($db);
        $data['amiga'] = $this->getBreadcrumbs();
        $proveedor = $proveedoresModel->find($id);
        if (!$proveedor) {
            return redirect()->to(base_url('proveedores'))->with('error', 'Proveedor no encontrado.');
        }
        $provinciasModel = new \App\Models\ProvinciasModel($db);
        $provincias = $provinciasModel->findAll();
        $builderPaises = $db->table('paises');
        $paises = $builderPaises->select('id, nombre')->get()->getResultArray();
        $builderFormasPago = $db->table('formas_pago');
        $formas_pago = $builderFormasPago->select('id_formapago, formapago')->get()->getResultArray();
---
SELECT *
FROM `provincias`
SELECT `id`, `nombre`
FROM `paises`
SELECT `id_formapago`, `formapago`
FROM `formas_pago`